apache/nuttx/arch/mips/src/pic32mz/pic32mz-ethernet.c
/* TX poll deley = 1 seconds. CLK_TCK is the number of clock ticks per second */

#define PIC32MZ_WDDELAY        (1*CLK_TCK)

/* TX timeout = 1 minute */

#define PIC32MZ_TXTIMEOUT      (60*CLK_TCK)

/* PHY timout = 1 minute */

#define PIC32MZ_MIITIMEOUT     (666666)

/* Ethernet MII clocking.
 *
 * The clock divider used to create the MII Management Clock (MDC).  The MIIM
 * module uses the SYSCLK as an input clock.  According to the IEEE 802.3
 * Specification this should be no faster than 2.5 MHz. However, some PHYs
 * support clock rates up to 12.5 MHz.
 *
 * The board.h file provides the "ideal" divisor as BOARD_EMAC_MIIM_DIV.  We
 * pick the closest, actual divisor greater than or equal to this.
 */

#ifndef BOARD_EMAC_MIIM_DIV
#  error "MIIM divider is not defined"
#elif BOARD_EMAC_MIIM_DIV <= 4
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV4
#elif BOARD_EMAC_MIIM_DIV <= 6
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV6
#elif BOARD_EMAC_MIIM_DIV <= 8
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV8
#elif BOARD_EMAC_MIIM_DIV <= 10
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV10
#elif BOARD_EMAC_MIIM_DIV <= 14
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV14
#elif BOARD_EMAC_MIIM_DIV <= 20
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV20
#elif BOARD_EMAC_MIIM_DIV <= 28
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV28
#elif BOARD_EMAC_MIIM_DIV <= 40
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV40
#elif BOARD_EMAC_MIIM_DIV <= 48
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV48
#elif BOARD_EMAC_MIIM_DIV <= 50
#  define EMAC1_MCFG_CLKSEL_DIV EMAC1_MCFG_CLKSEL_DIV50
#else
#  error "MIIM divider cannot be realized"
#endif

/* Interrupts ***************************************************************/

#define ETH_RXINTS             (ETH_INT_RXOVFLW | ETH_INT_RXBUFNA | ETH_INT_RXDONE | ETH_INT_RXBUSE)
#define ETH_TXINTS             (ETH_INT_TXABORT | ETH_INT_TXDONE | ETH_INT_TXBUSE)

/* Misc. Helpers ***********************************************************/

/* This is a helper pointer for accessing the contents of the Ethernet header */

#define BUF ((struct eth_hdr_s *)priv->pd_dev.d_buf)

/* PHYs *********************************************************************/
/* Select PHY-specific values.  Add more PHYs as needed. */

#if defined(CONFIG_ETH0_PHY_KS8721)
#  define PIC32MZ_PHYNAME      "KS8721"
#  define PIC32MZ_PHYID1       MII_PHYID1_KS8721
#  define PIC32MZ_PHYID2       MII_PHYID2_KS8721
#  define PIC32MZ_HAVE_PHY     1
#elif defined(CONFIG_ETH0_PHY_DP83848C)
#  define PIC32MZ_PHYNAME      "DP83848C"
#  define PIC32MZ_PHYID1       MII_PHYID1_DP83848C
#  define PIC32MZ_PHYID2       MII_PHYID2_DP83848C
#  define PIC32MZ_HAVE_PHY     1
#elif defined(CONFIG_ETH0_PHY_LAN8720)
#  define PIC32MZ_PHYNAME      "LAN8720"
#  define PIC32MZ_PHYID1       MII_PHYID1_LAN8720
#  define PIC32MZ_PHYID2       MII_PHYID2_LAN8720
#  define PIC32MZ_HAVE_PHY     1
#elif defined(CONFIG_ETH0_PHY_LAN8740)
#  define PIC32MZ_PHYNAME      "LAN8740"
#  define PIC32MZ_PHYID1       MII_PHYID1_LAN8740
#  define PIC32MZ_PHYID2       MII_PHYID2_LAN8740
#  define PIC32MZ_HAVE_PHY     1
#elif defined(CONFIG_ETH0_PHY_LAN8740A)
#  define PIC32MZ_PHYNAME      "LAN8740A"
#  define PIC32MZ_PHYID1       MII_PHYID1_LAN8740A
#  define PIC32MZ_PHYID2       MII_PHYID2_LAN8740A
#  define PIC32MZ_HAVE_PHY     1
#else
#  warning "No PHY specified!"
#  undef PIC32MZ_HAVE_PHY
#endif

/* These definitions are used to remember the speed/duplex settings */

#define PIC32MZ_SPEED_MASK     0x01
#define PIC32MZ_SPEED_100      0x01
#define PIC32MZ_SPEED_10       0x00

#define PIC32MZ_DUPLEX_MASK    0x02
#define PIC32MZ_DUPLEX_FULL    0x02
#define PIC32MZ_DUPLEX_HALF    0x00

#define PIC32MZ_10BASET_HD     (PIC32MZ_SPEED_10  | PIC32MZ_DUPLEX_HALF)
#define PIC32MZ_10BASET_FD     (PIC32MZ_SPEED_10  | PIC32MZ_DUPLEX_FULL)
#define PIC32MZ_100BASET_HD    (PIC32MZ_SPEED_100 | PIC32MZ_DUPLEX_HALF)
#define PIC32MZ_100BASET_FD    (PIC32MZ_SPEED_100 | PIC32MZ_DUPLEX_FULL)

#ifdef CONFIG_PIC32MZ_PHY_SPEED100
#  ifdef CONFIG_PIC32MZ_PHY_FDUPLEX
#    define PIC32MZ_MODE_DEFLT PIC32MZ_100BASET_FD
#  else
#    define PIC32MZ_MODE_DEFLT PIC32MZ_100BASET_HD
#  endif
#else
#  ifdef CONFIG_PIC32MZ_PHY_FDUPLEX
#    define PIC32MZ_MODE_DEFLT PIC32MZ_10BASET_FD
#  else
#    define PIC32MZ_MODE_DEFLT PIC32MZ_10BASET_HD
#  endif
#endif

/* Misc Helper Macros *******************************************************/

#define PHYS_ADDR(va) ((uint32_t)(va) & 0x1fffffff)
#define VIRT_ADDR(pa) (KSEG1_BASE | (uint32_t)(pa))

/* Ever-present MIN and MAX macros */

#ifndef MIN
#  define MIN(a,b) (a < b ? a : b)
#endif

#ifndef MAX
#  define MAX(a,b) (a > b ? a : b)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The pic32mz_driver_s encapsulates all state information for a single hardware
 * interface
 */

struct pic32mz_driver_s
{
  /* The following fields would only be necessary on chips that support
   * multiple Ethernet controllers.
   */

#if CONFIG_PIC32MZ_NINTERFACES > 1
  uint32_t   pd_base;           /* Ethernet controller base address */
  int        pd_irq;            /* Ethernet controller IRQ vector number */
  int        pd_irqsrc;         /* Ethernet controller IRQ source number */
#endif

  bool       pd_ifup;           /* true:ifup false:ifdown */
  bool       pd_txpending;      /* There is a pending Tx in pd_dev */
  bool       pd_polling;        /* Avoid concurrent attempts to poll */
  uint8_t    pd_mode;           /* Speed/duplex */
#ifdef PIC32MZ_HAVE_PHY
  uint8_t    pd_phyaddr;        /* PHY device address */
#endif
  uint8_t    pd_txnext;         /* Index to the next Tx descriptor */
  uint32_t   pd_inten;          /* Shadow copy of INTEN register */
  WDOG_ID    pd_txpoll;         /* TX poll timer */
  WDOG_ID    pd_txtimeout;      /* TX timeout timer */
  struct work_s pd_irqwork;     /* For deferring interrupt work to the work queue */
  struct work_s pd_pollwork;    /* For deferring poll work to the work queue */

  sq_queue_t pd_freebuffers;    /* The free buffer list */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s pd_dev;  /* Interface understood by the network */

  /* Descriptors and packet buffers */

