apache/nuttx/arch/mips/src/pic32mz/pic32mz-ethernet.c
  struct pic32mz_rxdesc_s pd_rxdesc[CONFIG_PIC32MZ_ETH_NRXDESC];
  struct pic32mz_txdesc_s pd_txdesc[CONFIG_PIC32MZ_ETH_NTXDESC];
  uint8_t pd_buffers[PIC32MZ_NBUFFERS * PIC32MZ_ALIGNED_BUFSIZE];
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Array of ethernet driver status structures */

static struct pic32mz_driver_s g_ethdrvr[CONFIG_PIC32MZ_NINTERFACES];

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations */

#ifdef CONFIG_NET_REGDEBUG
static void pic32mz_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void pic32mz_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t pic32mz_getreg(uint32_t addr);
static void pic32mz_putreg(uint32_t val, uint32_t addr);
#else
# define pic32mz_getreg(addr)     getreg32(addr)
# define pic32mz_putreg(val,addr) putreg32(val,addr)
#endif

/* Buffer and descriptor management */

#ifdef CONFIG_NET_DESCDEBUG
static void pic32mz_dumptxdesc(struct pic32mz_txdesc_s *txdesc, const char *msg);
static void pic32mz_dumprxdesc(struct pic32mz_rxdesc_s *rxdesc, const char *msg);
#else
# define pic32mz_dumptxdesc(txdesc,msg)
# define pic32mz_dumprxdesc(rxdesc,msg)
#endif

static inline void pic32mz_bufferinit(struct pic32mz_driver_s *priv);
static uint8_t *pic32mz_allocbuffer(struct pic32mz_driver_s *priv);
static void pic32mz_freebuffer(struct pic32mz_driver_s *priv, uint8_t *buffer);

static inline void pic32mz_txdescinit(struct pic32mz_driver_s *priv);
static inline void pic32mz_rxdescinit(struct pic32mz_driver_s *priv);
static inline struct pic32mz_txdesc_s *pic32mz_txdesc(struct pic32mz_driver_s *priv);
static inline void pic32mz_txnext(struct pic32mz_driver_s *priv);
static inline void pic32mz_rxreturn(struct pic32mz_rxdesc_s *rxdesc);
static struct pic32mz_rxdesc_s *pic32mz_rxdesc(struct pic32mz_driver_s *priv);

/* Common TX logic */

static int  pic32mz_transmit(struct pic32mz_driver_s *priv);
static int  pic32mz_txpoll(struct net_driver_s *dev);
static void pic32mz_poll(struct pic32mz_driver_s *priv);
static void pic32mz_timerpoll(struct pic32mz_driver_s *priv);

/* Interrupt handling */

static void pic32mz_response(struct pic32mz_driver_s *priv);
static void pic32mz_rxdone(struct pic32mz_driver_s *priv);
static void pic32mz_txdone(struct pic32mz_driver_s *priv);

static void pic32mz_interrupt_work(void *arg);
static int  pic32mz_interrupt(int irq, void *context, FAR void *arg);

/* Watchdog timer expirations */

static void pic32mz_txtimeout_work(void *arg);
static void pic32mz_txtimeout_expiry(int argc, uint32_t arg, ...);

static void pic32mz_poll_work(void *arg);
static void pic32mz_poll_expiry(int argc, uint32_t arg, ...);

/* NuttX callback functions */

static int pic32mz_ifup(struct net_driver_s *dev);
static int pic32mz_ifdown(struct net_driver_s *dev);

static void pic32mz_txavail_work(void *arg);
static int pic32mz_txavail(struct net_driver_s *dev);

#ifdef CONFIG_NET_IGMP
static int pic32mz_addmac(struct net_driver_s *dev, const uint8_t *mac);
static int pic32mz_rmmac(struct net_driver_s *dev, const uint8_t *mac);
#endif

/* PHY initialization functions */

#ifdef PIC32MZ_HAVE_PHY
#  ifdef CONFIG_NET_REGDEBUG
static void pic32mz_showmii(uint8_t phyaddr, const char *msg);
#  else
#    define pic32mz_showmii(phyaddr,msg)
#  endif

static void pic32mz_phybusywait(void);
static void pic32mz_phywrite(uint8_t phyaddr, uint8_t regaddr,
                             uint16_t phydata);
static uint16_t pic32mz_phyread(uint8_t phyaddr, uint8_t regaddr);
static inline int pic32mz_phyreset(uint8_t phyaddr);
#  ifdef CONFIG_PIC32MZ_PHY_AUTONEG
static inline int pic32mz_phyautoneg(uint8_t phyaddr);
#  endif
static int pic32mz_phymode(uint8_t phyaddr, uint8_t mode);
static inline int pic32mz_phyinit(struct pic32mz_driver_s *priv);
#else
#  define pic32mz_phyinit(priv)
#endif

/* EMAC Initialization functions */

static void pic32mz_macmode(uint8_t mode);
static void pic32mz_ethreset(struct pic32mz_driver_s *priv);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_printreg
 *
 * Description:
 *   Print the contents of an PIC32MZ register operation
 *
 ****************************************************************************/

#ifdef CONFIG_NET_REGDEBUG
static void pic32mz_printreg(uint32_t addr, uint32_t val, bool iswrite)
{
  ninfo("%08x%s%08x\n", addr, iswrite ? "<-" : "->", val);
}
#endif

/****************************************************************************
 * Name: pic32mz_checkreg
 *
 * Description:
 *   Get the contents of an PIC32MZ register
 *
 ****************************************************************************/

#ifdef CONFIG_NET_REGDEBUG
static void pic32mz_checkreg(uint32_t addr, uint32_t val, bool iswrite)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register last time?
   * Are we polling the register?  If so, suppress the output.
   */

  if (addr == prevaddr && val == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              pic32mz_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              ninfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

